IdeaRS.OpenModel.Loading.LoadInPoint
Concentrated load
This sample shows how to create a load in the point.
//Creating the model
OpenModel openModel = new OpenModel();
//Create nodes
Point3D pointA = new Point3D();
pointA.X = 0;
pointA.Y = 0;
pointA.Z = 0;
openModel.AddObject(pointA);
Point3D pointB = new Point3D();
pointB.X = 0;
pointB.Y = 0;
pointB.Z = 1.2;
openModel.AddObject(pointB);
Point3D pointC = new Point3D();
pointC.X = 0;
pointC.Y = 0;
pointC.Z = 2.4;
openModel.AddObject(pointC);
//Line between nodes
LineSegment3D line1 = new LineSegment3D();
line1.StartPoint = new ReferenceElement(pointA);
line1.EndPoint = new ReferenceElement(pointB);
//LCS of line
line1.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line1);
//Line between nodes
LineSegment3D line2 = new LineSegment3D();
line2.StartPoint = new ReferenceElement(pointB);
line2.EndPoint = new ReferenceElement(pointC);
//LCS of line
line2.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line2);
//Load case
LoadCase loadCase = new LoadCase();
//...
openModel.AddObject(loadCase);
//Point loading impulse in the node - int rthe LCS of node = GCS
LoadInPoint loadPoint = new LoadInPoint();
loadPoint.Geometry = new ReferenceElement(pointB);
loadPoint.Fx = -5e3; //in the global X direction
openModel.AddObject(loadPoint);
loadCase.LoadsInPoint.Add(new ReferenceElement(loadPoint));

IdeaRS.OpenModel.Loading.LoadInPoint.#ctor
Constructor

IdeaRS.OpenModel.Loading.LoadInPoint.Fx
Force in X direction

IdeaRS.OpenModel.Loading.LoadInPoint.Fy
Force in Y direction

IdeaRS.OpenModel.Loading.LoadInPoint.Fz
Force in Z direction

IdeaRS.OpenModel.Loading.LoadInPoint.Mx
Moment about the x-axis

IdeaRS.OpenModel.Loading.LoadInPoint.My
Moment about the y-axis

IdeaRS.OpenModel.Loading.LoadInPoint.Mz
Moment about the z-axis

IdeaRS.OpenModel.Loading.LoadInPoint.Geometry
Gets, sets geometry

IdeaRS.OpenModel.Loading.LoadInPoint.Direction
Local / global